app/views/items/_form.html.erb

SELECT "categories".* FROM "categories"
---
  <div class="input-field">
    <%= form.collection_select :category_id, Category.all, :id, :name, { prompt: 'Selecione uma categoria' }, class: 'browser-default' %>