app/controllers/items_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "items" SET "purchased" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["purchased", 1], ["updated_at", "2023-12-04 17:29:39.587244"], ["id", 7]]
---
  def mark_as_purchased
    @item = Item.find(params[:id])
    @item.update(purchased: true)

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "items" SET "purchased" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["purchased", 0], ["updated_at", "2023-12-04 17:29:41.372116"], ["id", 3]]
---
  def mark_as_not_purchased
    @item = Item.find(params[:id])
    @item.update(purchased: false)

SELECT "categories".* FROM "categories"
---
  def new
    @item = Item.new
    @categories = Category.all

INSERT INTO "items" ("name", "quantity", "created_at", "updated_at", "category_id", "price", "total_value") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "teste"], ["quantity", 1], ["created_at", "2023-12-06 20:46:40.773604"], ["updated_at", "2023-12-06 20:46:40.773604"], ["category_id", 3], ["price", 10.0], ["total_value", 10.0]]
---
  def create
    @item = Item.new(item_params)

    if @item.save

SELECT "categories".* FROM "categories"
---
  def edit
    @categories = Category.all

SELECT "categories".* FROM "categories"
UPDATE "items" SET "category_id" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["category_id", 2], ["updated_at", "2023-12-04 20:58:29.043286"], ["id", 3]]
---
  def update
    @categories = Category.all

    if @item.update(item_params)

DELETE FROM "items" WHERE "items"."id" = ?  [["id", 3]]
---
  def destroy
    @item.destroy